//
// Created by nikita on 24.04.2025.
//

#include <iostream>
#include "../tasks.h"

using namespace std;

void task8() {
    cout << "Суть восьмой лабораторной работы заключается в выполнение задания третьего и четвертого семинаров, оформив каждый пункт задания в виде шаблона функции." << endl;
    cout << "Все необходимые данные для функций должны передаваться им в качестве параметров. Использование глобальных переменных в функциях не допускается." << endl;
    cout << "Так же нужно привести примеры программ, использующих эти шаблоны для типов int, float и double." << endl;

    while (true) {
        int i;

        cout << "Введите: ";

        cin >> i;

        cout << "Ваш ввод: " << i << endl;


    }
}